from aiogram import Bot, F, Router
from aiogram.filters import Command, CommandStart
from aiogram.fsm.context import FSMContext
from aiogram.types import CallbackQuery, Message

from keyboards import MainUserKeyboard
from models import User

router = Router()


@router.callback_query(F.data == "to_main")
async def to_main_menu(callback: CallbackQuery, state: FSMContext, current_user: User, bot: Bot):
    await state.clear()
    await process_start_command(callback.message, state, current_user=current_user, bot=bot)
    await callback.answer()
    await callback.message.delete()  # type: ignore


@router.message(CommandStart())
@router.message(F.text == "🏠 На главную")
async def process_start_command(message: Message, state: FSMContext, current_user: User, bot: Bot) -> None:
    await state.clear()

    welcome_text = (
        "🎵 <i>Добро пожаловать в мир музыки!</i>\n\n"
        "Я - Ира Эйфория, автор сотен хитов, которые звучат в исполнении звёзд первой величины: Григория Лепса, Ларисы"
        "Долиной, Полины Гагариной, Димы Билана, Ольги Бузовой, Юлии Паршуты, Эмина и многих других.\n\n"
        "<b>Я создала для вас индивидуальный подход и удобный каталог песен, где вы сможете:</b>\n\n"
        "• Самостоятельно <b>изучить материал</b>;\n"
        "• Создать <b>список желаемых песен</b>;\n"
        "• <b>Попробовать исполнить</b> понравившиеся песни;\n"
        "• Перейти в пункт <b>Хочу эту песню</b>, написать название песни, при желании прописать 3 правки по песне.\n\n"
        "<b>Как это работает?</b>\n\n"
        "1. <b>Выберите жанр</b> от поп-баллад до танцевальных треков.\n"
        "2. <b>Прослушайте полную версию песни.</b>\n"
        "3. <b>Купите в один клик</b>, чтобы получить мультитрек и все необходимые права.\n\n"
        "🎵 Заходите в каталог песен и найдите идеальную композицию для себя и своего уникального голоса прямо сейчас!\n\n"
        "<i>Всё необходимое здесь и сейчас. Вперёд к музыке! 🚀</i>"
    )

    keyboard = MainUserKeyboard()(current_user.is_staff)
    await bot.send_message(message.chat.id, welcome_text, reply_markup=keyboard)


@router.message(Command("help"))
async def process_help_command(message: Message, current_user: User, bot: Bot) -> None:
    help_text = (
        "🎵 <b>Справка по использованию бота</b>\n\n"
        "Здесь вы найдёте всю необходимую информацию о работе с музыкальным каталогом.\n\n"
        "🎵 <b>Основные функции:</b>\n\n"
        "• Поиск песен: по жанру и типу исполнения\n"
        "• Прослушивание демо-версий: оцените звучание перед покупкой\n"
        "• Чтение текста: ознакомьтесь со словами песен\n"
        "• Добавление в список желаний: сохраните понравившиеся треки\n"
        "• Покупка полной версии: с получением всех прав\n\n"
        "🛒 <b>Как приобрести песню:</b>\n\n"
        "1. Найдите идеальную композицию в каталоге\n"
        "2. Нажмите «Хочу эту песню!»\n"
        "3. Мои помощники свяжутся с вами для обсуждения деталей!\n\n"
        "📌 <b>Основные команды:</b>\n\n"
        "• /start — Главное меню\n"
        "• /help — Справка о боте\n"
        "• /catalog — Каталог песен\n"
        "• /wishlist — Список желаемых песен\n\n"
        "<b>Пусть моя песня станет вашим саундтреком! Желаю, чтобы вы нашли ту самую, в которой бьётся ритм "
        "вашего сердца. 🎶</b>"
    )

    keyboard = MainUserKeyboard()(current_user.is_staff)
    await bot.send_message(message.chat.id, help_text, reply_markup=keyboard)


__all__ = ["router"]
